// متغییری به نام دلخواه تعریف کرده و مقدار آن را به صورت رشته قرار دهید.

// مقدار متغییر تعریف شده در بالا را به عدد تغییر دهید

// آبجکت به نام دلخواه تعریف کرده و فیلدهای با مقادیر رشته و عدد در آن تعریف کنید .

// مقادیر آبجکت تعریف شده در بالا را تغییر دهید به طوری که  خود آبجکت اصلی تغییر نکند

// دو مورد ذکر شده در بالا را بر روی آرای نیز انجام دهید

// تایپ متغییر های زیر را به موراد خواسته شده تغییر دهید
const name = 'John'; // To Boolean
const age = 30; // To String
const job = '33'; // To Number
const city = true; // To String
const objO = { name: 'John', age: 30 }; // To string(json)
const objT = { name: 'John', age: 30 }; // To array of obj values
const array = [1, 2, 3, 4, 5]; // To object

//فانکنشنی به حالت های زیر تعریف کنید که دو ورودی دریافت کرده و مجموع دو ورودی را بر میگرداند
// arrow function
// anonymous  function
// function declaration

// آرایه های زیر را با هم مرج کنیید
const array = [1, 2, 3, 4, 5];
const array2 = ['John', 'Mark', 'Jane'];

// آبجکت های زیر را باهم مرج کنید
const obj1 = { name: 'John', age: 30 };
const obj2 = { fn: 'Mark', fan: 'Zorg' };

//  عملیات های زیر را  روی آرایه قرار داده شده انجام دهید
// 1. یک یوزر به آرایه اضافه کنید
// 2.یوزر با آیدی 3 را از آرایه حذف کنید
// 3. یوزر با نام با آیدی 1 را پیدا کنید
// 4.نام یوزر با آیدی 1 را به مقدار دلخواه تغییر دهید
// 5. یوزر های با سن بالاتر از 35 و زیر 30 را در یک آرایه دیگر قرار دهید
const users = [
  { id: 1, name: 'John', age: 30 },
  { id: 2, name: 'Mark', age: 23 },
  { id: 3, name: 'Jane', age: 26 },
  { id: 4, name: 'Mary', age: 18 },
  { id: 5, name: 'Peter', age: 35 },
  { id: 6, name: 'Paul', age: 45 },
  { id: 7, name: 'Mary', age: 18 },
];

// عملیات های زیر را انجام دهید

// 1. کلاسی به نام یوزر ایجاد کنید
// 2. نام یوزر را گرفته و برای نام یوزر به صورت خصوصی متغییر و گتر و ستر تعریف کنید
// 3. دو یوزر جدید با کلاس یوزر ایجاد کنید
// 4. دو کلاس جدید با ارث بری از یوزر ایجاد کنید
// 5. متدی در هر کلاس ایجاد کنید که نام کلاس را کنسول نماید

// عملیات های زیر را انجام دهید
const url = 'https://jsonplaceholder.typicode.com/posts';
// 1. پست ها را از آدرس زیر دریافت کنید
// 2. پستهای دریافتی را در متغییر جدید بریزید
// 3. پستهای دریافتی را در کنسول  نمایش دهید
